#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include <string.h>


//操作符	含义
//
//1.单目操作符
//！		逻辑反操作
//-			负值
//+			正值
//&			取地址
//sizeof	操作数的类型长度（字节）
//~			对一个数的二进制按位取反
//--		前置、后置--
//++		前置、后置++
//*			间接访问操作符（解引用操作符）
//(类型)	强制类型转换
//
//2.关系操作符
//>		<		>=		<=		!=		==
// 
//3.逻辑操作符
//&&		逻辑与
//||		逻辑或
//
//4.条件操作符
//exp1 ? exp2 : exp3		如果exp1为真则输出exp2；如果exp1为假则输出exp3
//
//5.逗号表达式
//exp1,exp2,exp3,...expN
// 
//6.其他
//[]		下标
//()		函数调用操作符
//.
//->
//
//
//指针变量（变量类型）*
//
//
//